<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a02861193ba956f09e00b160ce0c7ae8b2b1e721573dba538bd312beeb3bb001","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #832 at https://github.com/cal-itp/data-infra/actions/runs/18700005723","plan_out_hash":"c099ae58a93b3acc7d8a8090258198bee7272ce6623e5725a91c90b399d40b41","plan_hash":"db75b7489de8e0aa41ff8e1459cf3eb47d8821440beceec3ca8ace039113cd85","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 7 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_elavon/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "/x/Fcg==" -> (known after apply)
!~      detect_md5hash      = "CElUl9YjpaCAGPtnLRUFCw==" -> "different hash"
!~      generation          = 1753225939814327 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_elavon/METADATA.yml"
!~      md5hash             = "CElUl9YjpaCAGPtnLRUFCw==" -> (known after apply)
        name                = "dags/parse_elavon/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/publish_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "xNl1wQ==" -> (known after apply)
!~      detect_md5hash      = "Tj3MIbzAD1/RkVb6FAVnmw==" -> "different hash"
!~      generation          = 1760994532319565 -> (known after apply)
        id                  = "calitp-staging-composer-dags/publish_gtfs.py"
!~      md5hash             = "Tj3MIbzAD1/RkVb6FAVnmw==" -> (known after apply)
        name                = "dags/publish_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_elavon/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "vJCzsQ==" -> (known after apply)
!~      detect_md5hash      = "WZSz+bbxdl6QADm1OZD99g==" -> "different hash"
!~      generation          = 1753225940185335 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_elavon/METADATA.yml"
!~      md5hash             = "WZSz+bbxdl6QADm1OZD99g==" -> (known after apply)
        name                = "dags/sync_elavon/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_elavon/elavon_to_gcs_raw.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "tTUd1w==" -> (known after apply)
!~      detect_md5hash      = "FXiCPeCjZHE3J9mWyszr0w==" -> "different hash"
!~      generation          = 1760994532361685 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_elavon/elavon_to_gcs_raw.py"
!~      md5hash             = "FXiCPeCjZHE3J9mWyszr0w==" -> (known after apply)
        name                = "dags/sync_elavon/elavon_to_gcs_raw.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/ckan_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "YSR+bw==" -> (known after apply)
!~      detect_md5hash      = "M4UpDcybCS1BOsyu/bHXpw==" -> "different hash"
!~      generation          = 1760994532361746 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/ckan_hook.py"
!~      md5hash             = "M4UpDcybCS1BOsyu/bHXpw==" -> (known after apply)
        name                = "plugins/hooks/ckan_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/dbt_bigquery_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "NkWsAA==" -> (known after apply)
!~      detect_md5hash      = "zuWzs/N1D7EeoAmBphwG1A==" -> "different hash"
!~      generation          = 1761087246207064 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/dbt_bigquery_to_gcs_operator.py"
!~      md5hash             = "zuWzs/N1D7EeoAmBphwG1A==" -> (known after apply)
        name                = "plugins/operators/dbt_bigquery_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "NiTmmA==" -> (known after apply)
!~      detect_md5hash      = "OUthi8/nuad4CH/kP8JDVQ==" -> "different hash"
!~      generation          = 1761007607116931 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "OUthi8/nuad4CH/kP8JDVQ==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #832](https://github.com/cal-itp/data-infra/actions/runs/18700005723)